Sighthesia/micropython/ports/stm32/boards/OPENMV4/mpconfigboard.h
/*
 * This file is part of the MicroPython project, http://micropython.org/
 * The MIT License (MIT)
 * Copyright (C) 2013-2025 OpenMV, LLC.
 */

#define MICROPY_HW_BOARD_NAME "OPENMV4"
#define MICROPY_HW_MCU_NAME "STM32H743"
#define MICROPY_PY_SYS_PLATFORM "OpenMV4-H7"
#define MICROPY_HW_FLASH_FS_LABEL "OPENMV"

// Network config
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "mpy-openmv-4"

#define MICROPY_OBJ_REPR (MICROPY_OBJ_REPR_C)
#define UINT_FMT "%u"
#define INT_FMT "%d"
typedef int mp_int_t;           // must be pointer size
typedef unsigned int mp_uint_t; // must be pointer size

#define MICROPY_FATFS_EXFAT (1)
#define MICROPY_HW_ENABLE_RTC (1)
#define MICROPY_HW_ENABLE_RNG (1)
#define MICROPY_HW_ENABLE_ADC (1)
#define MICROPY_HW_ENABLE_DAC (1)
#define MICROPY_HW_ENABLE_SPI2 (1)
#define MICROPY_HW_ENABLE_USB (1)
#define MICROPY_HW_HAS_FLASH (1)
#define MICROPY_HW_ENABLE_SERVO (1)
#define MICROPY_HW_ENABLE_TIMER (1)
#define MICROPY_HW_ENABLE_SDCARD (1)
#define MICROPY_HW_ENTER_BOOTLOADER_VIA_RESET (0)
#define MICROPY_HW_TIM_IS_RESERVED(id) (id == 1 || id == 6)

// ROMFS config
#define MICROPY_HW_ROMFS_ENABLE_INTERNAL_FLASH (1)
#define MICROPY_HW_ROMFS_ENABLE_PART0 (1)

extern void board_enter_bootloader(void);
#define MICROPY_BOARD_ENTER_BOOTLOADER(nargs, args) board_enter_bootloader()

// Note these are not used in top system.c.
#define MICROPY_HW_CLK_PLLM (3)
#define MICROPY_HW_CLK_PLLN (200)
#define MICROPY_HW_CLK_PLLP (2)
#define MICROPY_HW_CLK_PLLQ (8)
#define MICROPY_HW_CLK_PLLR (2)

// UART1 config
#define MICROPY_HW_UART1_TX (pin_B14)
#define MICROPY_HW_UART1_RX (pin_B15)

// UART3 config - 禁用以避免与摄像头I2C冲突
// 注意: PB10/PB11现在专门用于摄像头I2C2总线
/* ---------------------------------- 修改部分 ---------------------------------- */
// 原有UART3配置（与摄像头I2C冲突，已禁用）
// #define MICROPY_HW_UART3_TX  (pin_B10)
// #define MICROPY_HW_UART3_RX  (pin_B11)
// #define MICROPY_HW_UART3_RTS (pin_B14)
// #define MICROPY_HW_UART3_CTS (pin_B13)

// I2C buses
// I2C2用于摄像头通信 (PB10=SCL, PB11=SDA)
#define MICROPY_HW_I2C2_SCL (pin_B10)
#define MICROPY_HW_I2C2_SDA (pin_B11)

#define MICROPY_HW_I2C4_SCL (pin_D12)
#define MICROPY_HW_I2C4_SDA (pin_D13)

// SPI buses
// 注意: SPI2引脚与用户引脚P0-P3有冲突，使用时需要注意
#define MICROPY_HW_SPI2_NSS (pin_B12)  // 与用户引脚P3冲突
#define MICROPY_HW_SPI2_SCK (pin_B13)  // 与用户引脚P2冲突
#define MICROPY_HW_SPI2_MISO (pin_B14) // 与用户引脚P1冲突
#define MICROPY_HW_SPI2_MOSI (pin_B15) // 与用户引脚P0冲突

// FDCAN bus
// 注意: CAN2引脚与用户引脚P2/P3有冲突，使用时需要注意
#define MICROPY_HW_CAN2_NAME "FDCAN2"
#define MICROPY_HW_CAN2_TX (pin_B13) // 与用户引脚P2冲突
#define MICROPY_HW_CAN2_RX (pin_B12) // 与用户引脚P3冲突
#define MICROPY_HW_CAN_IS_RESERVED(id) (id != PYB_CAN_2)

// SD card detect switch
#define MICROPY_HW_SDCARD_DETECT_PIN (pin_D0)
#define MICROPY_HW_SDCARD_DETECT_PULL (GPIO_PULLUP)
#define MICROPY_HW_SDCARD_DETECT_PRESENT (GPIO_PIN_RESET)

// USB config
#define MICROPY_HW_USB_FS (1)
#define MICROPY_HW_USB_CDC_RX_DATA_SIZE (512)
#define MICROPY_HW_USB_CDC_TX_DATA_SIZE (512)
#define MICROPY_HW_USB_VBUS_DETECT_PIN (pin_A9)

// LEDs
#define MICROPY_HW_LED1 (pin_C13) // red
#define MICROPY_HW_LED2 (pin_C13) // green
#define MICROPY_HW_LED3 (pin_C13) // blue
#define MICROPY_HW_LED4 (pin_C13) // IR
#define MICROPY_HW_LED_OTYPE (GPIO_MODE_OUTPUT_PP)
// NOTE: LEDs are active low.
#define MICROPY_HW_LED_ON(pin) (pin->gpio->BSRR = (pin->pin_mask << 16))
#define MICROPY_HW_LED_OFF(pin) (pin->gpio->BSRR = pin->pin_mask)

// Servos
#define PYB_SERVO_NUM (4)

// Board network interfaces config.
#if MICROPY_PY_WINC1500
extern const struct _mp_obj_type_t mod_network_nic_type_winc;
#define MICROPY_PY_USOCKET_EXTENDED_STATE (1)
#define MICROPY_BOARD_NETWORK_INTERFACES                                 \
    {MP_ROM_QSTR(MP_QSTR_WINC), MP_ROM_PTR(&mod_network_nic_type_winc)}, \
        {MP_ROM_QSTR(MP_QSTR_WLAN), MP_ROM_PTR(&mod_network_nic_type_winc)},
#else
#define MICROPY_BOARD_NETWORK_INTERFACES
#endif

#define MICROPY_HW_USB_VID 0x37C5
#define MICROPY_HW_USB_PID 0x1204
#define MICROPY_HW_USB_PID_CDC_MSC (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_PID_CDC_HID (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_PID_CDC (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_PID_MSC (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_PID_CDC2_MSC (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_PID_CDC2 (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_PID_CDC3 (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_PID_CDC3_MSC (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_PID_CDC_MSC_HID (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_PID_CDC2_MSC_HID (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_PID_CDC3_MSC_HID (MICROPY_HW_USB_PID)
#define MICROPY_HW_USB_LANGID_STRING 0x409
#define MICROPY_HW_USB_MANUFACTURER_STRING "OpenMV"
#define MICROPY_HW_USB_PRODUCT_FS_STRING "OpenMV Virtual Comm Port in FS Mode"
#define MICROPY_HW_USB_PRODUCT_HS_STRING "OpenMV Virtual Comm Port in HS Mode"
#define MICROPY_HW_USB_INTERFACE_FS_STRING "VCP Interface"
#define MICROPY_HW_USB_INTERFACE_HS_STRING "VCP Interface"
#define MICROPY_HW_USB_CONFIGURATION_FS_STRING "VCP Config"
#define MICROPY_HW_USB_CONFIGURATION_HS_STRING "VCP Config"
